pmo-dataset/graphviz/19.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "ExclusiveGateway_2" -> "Return items";
  "start" -> "Login";
  "Select free reward" -> "ParallelGateway_3";
  "Complete installment\nagreement" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "ParallelGateway_3";
  "ParallelGateway_2" -> "Select free reward";
  "Select items" -> "ParallelGateway_2";
  "ParallelGateway_3" -> "ExclusiveGateway_3";
  "Set payment method" -> "ParallelGateway_1";
  "ParallelGateway_4" -> "Select items";
  "Return items" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "Deliver items";
  "ExclusiveGateway_4" -> "Complete installment\nagreement";
  "Login" -> "ParallelGateway_4";
  "ParallelGateway_1" -> "ExclusiveGateway_4";
  "ExclusiveGateway_2" -> "end";
  "Pay" -> "ExclusiveGateway_1";
  "ParallelGateway_2" -> "ParallelGateway_1";
  "ExclusiveGateway_4" -> "Pay";
  "Deliver items" -> "ExclusiveGateway_2";
  "ParallelGateway_4" -> "Set payment method";

  "start" [shape=circle];
  "end" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
}
