pmo-dataset/mermaid/19.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	ExclusiveGateway_2{"X"} --> Task_7["Return items"]
	StartNoneEvent_1(("start")) --> Task_6["Login"]
	Task_3["Select free reward"] --> ParallelGateway_3{"+"}
	Task_8["Complete installment\nagreement"] --> ExclusiveGateway_1{"X"}
	ExclusiveGateway_1 --> ParallelGateway_3
	ParallelGateway_2{"+"} --> Task_3
	Task_1["Select items"] --> ParallelGateway_2
	ParallelGateway_3 --> ExclusiveGateway_3{"X"}
	Task_2["Set payment method"] --> ParallelGateway_1{"+"}
	ParallelGateway_4{"+"} --> Task_1
	Task_7 --> ExclusiveGateway_3
	ExclusiveGateway_3 --> Task_4["Deliver items"]
	ExclusiveGateway_4{"X"} --> Task_8
	Task_6 --> ParallelGateway_4
	ParallelGateway_1 --> ExclusiveGateway_4
	ExclusiveGateway_2 --> EndNoneEvent_1(("end")):::endEvent
	Task_5["Pay"] --> ExclusiveGateway_1
	ParallelGateway_2 --> ParallelGateway_1
	ExclusiveGateway_4 --> Task_5
	Task_4 --> ExclusiveGateway_2
	ParallelGateway_4 --> Task_2
